STMicroelectronics/STM32CubeMP13/Projects/STM32MP13XX_CUSTOM_HW/External_Loader/SNOR_Ext_Loader/BSP/stm32mp13xx_valid.c
  /* By default, turn off LED */
  BSP_LED_Off(Led);

return status;
}


/**
  * @brief  DeInit LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  *            @arg  LED5
  * @note Led DeInit does not disable the GPIO clock.
  */
int32_t BSP_LED_DeInit(Led_TypeDef Led)
{
  int32_t  status = BSP_ERROR_NONE;
  GPIO_InitTypeDef  gpio_init_structure;
  /* Turn off LED */
  BSP_LED_Off(Led);
    /* Configure the GPIO_LED pin */
  gpio_init_structure.Pin = LED_PIN[Led];
  BSP_ENTER_CRITICAL_SECTION(LED_PORT[Led]);
  HAL_GPIO_DeInit(LED_PORT[Led], gpio_init_structure.Pin);
  BSP_EXIT_CRITICAL_SECTION(LED_PORT[Led]);

return status;
}

/**
  * @brief  Turns selected LED On.
  * @param  Led LED to be set on
  *          This parameter can be one of the following values:
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  *            @arg  LED5
  */
int32_t BSP_LED_On(Led_TypeDef Led)
{
  int32_t  status = BSP_ERROR_NONE;
#if defined (USE_STM32MP13XX_VALID1) || defined (USE_STM32MP13XX_VALID3)
  if((Led == LED2) || (Led == LED3))
  {
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET);
  }
  else if ((Led == LED4) || (Led == LED5))
  {
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET);
  }
#endif
#if defined (USE_STM32MP13XX_VALID2)
  if((Led == LED1) || (Led == LED2))
  {
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET);
  }
  else if ((Led == LED3) || (Led == LED4))
  {
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET);
  }
#endif
  return status;
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led LED to be set off
  *          This parameter can be one of the following values:
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  *            @arg  LED5
  */
int32_t BSP_LED_Off(Led_TypeDef Led)
{
  int32_t  status = BSP_ERROR_NONE;
#if defined (USE_STM32MP13XX_VALID1) || defined (USE_STM32MP13XX_VALID3)
  if((Led == LED2) || (Led == LED3))
  {
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET);
  }
  else if ((Led == LED4) || (Led == LED5))
  {
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET);
  }
#endif
#if defined (USE_STM32MP13XX_VALID2)
  if((Led == LED1) || (Led == LED2))
  {
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET);
  }
  else if ((Led == LED3) || (Led == LED4))
  {
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET);
  }
#endif
  return status;
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led LED to be toggled
  *          This parameter can be one of the following values:
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  *            @arg  LED5
  */
int32_t BSP_LED_Toggle(Led_TypeDef Led)
{
  int32_t  status = BSP_ERROR_NONE;
  /* Toggle GPIO Led Pin */
  HAL_GPIO_TogglePin(LED_PORT[Led], LED_PIN[Led]);
  return status;
}

/**
  * @brief  Get the state of selected LED.
  * @param  Led Specifies the Led.
  *   This parameter can be one of following parameters:
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  *            @arg  LED5
  * @retval 0 means off, 1 means on, negative value means error.
  */
int32_t BSP_LED_GetState(Led_TypeDef Led)
{
  int32_t status;

  status = (HAL_GPIO_ReadPin(LED_PORT[Led], LED_PIN[Led]) == GPIO_PIN_RESET) ? 1 : 0;

  return status;
}
/**
  * @}
  */

/** @addtogroup STM32MP13XX_VALID_LOW_LEVEL_Exported_Functions_Group2 BUTTON Functions
  * @{
  */

/**
  * @brief  Configures button GPIO and EXTI Line.
  * @param  Button Button to be configured
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_WAKEUP: Wakeup Push Button
  *            @arg  BUTTON_USER: User Push Button
  *            @arg  BUTTON_USER2: User2 Push Button
  * @param  ButtonMode Button mode
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_MODE_GPIO: Button will be used as simple IO
  *            @arg  BUTTON_MODE_EXTI: Button will be connected to EXTI line
  *                                    with interrupt generation capability
  */
int32_t BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode)
{
  int32_t  status = BSP_ERROR_NONE;
  GPIO_InitTypeDef      gpio_init_structure;
  static uint32_t  BSP_BUTTON_IT_PRIORITY[BUTTONn] = {BSP_BUTTON_WAKEUP_IT_PRIORITY, BSP_BUTTON_USER_IT_PRIORITY, BSP_BUTTON_USER2_IT_PRIORITY};
#ifdef HAL_EXTI_MODULE_ENABLED
  static uint32_t  BUTTON_EXTI_LINE[BUTTONn]   = {WAKEUP_BUTTON_EXTI_LINE, USER_BUTTON_EXTI_LINE, USER2_BUTTON_EXTI_LINE};
  static BSP_EXTI_LineCallback  ButtonCallback[BUTTONn]     = {BUTTON_WAKEUP_EXTI_Callback, BUTTON_USER_EXTI_Callback, BUTTON_USER2_EXTI_Callback};
#endif

  /* Enable the BUTTON clock */
  switch(Button)
  {
  case BUTTON_WAKEUP:
    /* BUTTON_WAKEUP clock enable */
    WAKEUP_BUTTON_GPIO_CLK_ENABLE();
    break;
  case BUTTON_USER:
    /* BUTTON_USER clock enable */
    USER_BUTTON_GPIO_CLK_ENABLE();
    break;
  case BUTTON_USER2:
    /* BUTTON_USER2 clock enable */
    USER2_BUTTON_GPIO_CLK_ENABLE();
    break;
  default:
    break;
  }

  if(ButtonMode == BUTTON_MODE_GPIO)
  {
    /* Configure Button pin as input */
    gpio_init_structure.Pin = BUTTON_PIN[Button];
    gpio_init_structure.Mode = GPIO_MODE_INPUT;
    gpio_init_structure.Pull = GPIO_PULLUP;
    gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
    BSP_ENTER_CRITICAL_SECTION(BUTTON_PORT[Button]);
    HAL_GPIO_Init(BUTTON_PORT[Button], &gpio_init_structure);
    BSP_EXIT_CRITICAL_SECTION(BUTTON_PORT[Button]);
  }

  else /*(ButtonMode == BUTTON_MODE_EXTI) */
  {
    /* Configure Button pin as input with External interrupt */
    gpio_init_structure.Pin = BUTTON_PIN[Button];
    gpio_init_structure.Pull = GPIO_NOPULL; //GPIO_PULLUP;
    gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
    gpio_init_structure.Mode = GPIO_MODE_IT_RISING;
    BSP_ENTER_CRITICAL_SECTION(BUTTON_PORT[Button]);
    HAL_GPIO_Init(BUTTON_PORT[Button], &gpio_init_structure);
    BSP_EXIT_CRITICAL_SECTION(BUTTON_PORT[Button]);

    /* Enable and set Button EXTI Interrupt to the lowest priority */
#ifdef HAL_EXTI_MODULE_ENABLED
    if (HAL_EXTI_GetHandle(&hExtiButtonHandle[Button], BUTTON_EXTI_LINE[Button]) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    if (HAL_EXTI_RegisterCallback(&hExtiButtonHandle[Button], HAL_EXTI_RISING_CB_ID, ButtonCallback[Button]) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
#endif
#if defined (CORE_CA7)
        IRQ_SetPriority(BUTTON_IRQn[Button], BSP_BUTTON_IT_PRIORITY[Button]);
        IRQ_Enable(BUTTON_IRQn[Button]);
#else
        HAL_NVIC_SetPriority((IRQn_Type)(BUTTON_IRQn[Button]), BSP_BUTTON_IT_PRIORITY[Button], 0x00);
        HAL_NVIC_EnableIRQ((IRQn_Type)(BUTTON_IRQn[Button]));
#endif

