STMicroelectronics/STM32CubeMP13/Projects/STM32MP13XX_CUSTOM_HW/External_Loader/SNOR_Ext_Loader/BSP/stm32mp13xx_valid.c
#ifdef HAL_EXTI_MODULE_ENABLED
/** @addtogroup STM32MP13XX_VALID_LOW_LEVEL_Private_Functions_Group1 BUTTON Functions
  * @{
  */

/**
  * @brief  Wakeup EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_WAKEUP_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_WAKEUP);
}

/**
  * @brief  User EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_USER_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_USER);
}

/**
  * @brief  User2 EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_USER2_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_USER2);
}

/**
  * @brief  BSP Push Button callback
  * @param  Button Specifies the pin connected EXTI line
  * @retval None.
  */
__weak void BSP_PB_Callback(Button_TypeDef Button)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Button);

  /* This function should be implemented by the user application.
     It is called into this driver when an event on Button is triggered. */
}

/**
  * @brief  This function handles Push-Button interrupt requests.
  * @param  Button Specifies the pin connected EXTI line
  * @retval None
  */
void BSP_PB_IRQHandler(Button_TypeDef Button)
{
  HAL_EXTI_IRQHandler(&hExtiButtonHandle[Button]);
}
#endif

/**
  * @}
  */

#if (USE_BSP_COM_FEATURE == 1)
#ifdef HAL_UART_MODULE_ENABLED
/** @addtogroup STM32MP13XX_VALID_LOW_LEVEL_Private_Functions_Group2 COM Functions
  * @{
  */
/**
  * @brief  Initializes UART MSP.
  * @param  huart UART handle
  * @retval None
  */
static void COM1_MspInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef gpio_init_structure;
  /* Enable GPIO clock */
  COM1_TX_GPIO_CLK_ENABLE();
  COM1_RX_GPIO_CLK_ENABLE();

  /* Enable USART clock */
  COM1_CLK_ENABLE();

  /* Configure USART Tx as alternate function */
  gpio_init_structure.Pin = COM1_TX_PIN;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Pull = GPIO_PULLUP;
  gpio_init_structure.Alternate = COM1_TX_AF;
  BSP_ENTER_CRITICAL_SECTION(COM1_TX_GPIO_PORT);
  HAL_GPIO_Init(COM1_TX_GPIO_PORT, &gpio_init_structure);
  BSP_EXIT_CRITICAL_SECTION(COM1_TX_GPIO_PORT);

  /* Configure USART Rx as alternate function */
  gpio_init_structure.Pin = COM1_RX_PIN;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Alternate = COM1_RX_AF;
  BSP_ENTER_CRITICAL_SECTION(COM1_RX_GPIO_PORT);
  HAL_GPIO_Init(COM1_RX_GPIO_PORT, &gpio_init_structure);
  BSP_EXIT_CRITICAL_SECTION(COM1_RX_GPIO_PORT);
}

/**
  * @brief  Initialize USART6 Msp part
  * @param  huart UART handle
  * @retval None
  */
static void COM1_MspDeInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef gpio_init_structure;

  /* COM GPIO pin configuration */
  gpio_init_structure.Pin  = COM1_TX_PIN;
  BSP_ENTER_CRITICAL_SECTION(COM1_TX_GPIO_PORT);
  HAL_GPIO_DeInit(COM1_TX_GPIO_PORT, gpio_init_structure.Pin);
  BSP_EXIT_CRITICAL_SECTION(COM1_TX_GPIO_PORT);

  gpio_init_structure.Pin  = COM1_RX_PIN;
  BSP_ENTER_CRITICAL_SECTION(COM1_RX_GPIO_PORT);
  HAL_GPIO_DeInit(COM1_RX_GPIO_PORT, gpio_init_structure.Pin);
  BSP_EXIT_CRITICAL_SECTION(COM1_RX_GPIO_PORT);
  /* Disable USART clock */
  COM1_CLK_DISABLE();

}
#endif
#endif /* (USE_BSP_COM_FEATURE == 1) */

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
